# frozen_string_literal: true

class AngerRecord < ApplicationRecord
end

# get リスエスト タップ フック
# タップしたらその日のレコードにいく
# 非同期にする
# 非同期じゃない場合はリンクにする
# 非同期ジャない場合から非同期にしても良い
# 非同期リンクにして

# カレンダーページ（それぞれ遷移図を書く）
# ルーティング（
# 詳細のページ
# URLのコード（どんなURLにするか決める）
# ルートを決める
# URL(どんなURLか2種類方法があるからどうなものか調べる）
# どっちを主語にしてみるか
#

# カレンダーページの作り方のイメージ
# simple calendar や fullcalendarなどのgemを使ってカレンダーを作るべきか、使わないで作るべきか
# fullcalendarはjQueryを使っていてjQueryはあまり使いたくないのでfullcalendarはなしかなと
# simple calendar で自分が求めているカレンダーの下に指定した日の記録が表示されるようにできるのかどうか怪しい
# Gemを使わないで作った方が自分好みに出来やすいからその方が良いかも

# カレンダーのテーブルは必要ないので入れなくて大丈夫です。dateをもとに必要なレコードを引っ張り、レンダリングするという流れになるためです。

# インターンシップか新卒は外資系か医療系、無理だったら片っ端から応募していく。
# https://www.wantedly.com/companies/company_151466/post_articles/284739
# https://www.wantedly.com/projects/281822
# https://www.wantedly.com/projects/535124

# async/await を使うと上から順に読み込む
# ajsacs

# 4月から
# 内定者アルバイト　１年ぐらい
# ３〜４ヶ月後に違うインターンでも
# 学生向けでも気にせず受けてみる

# １デイ　やってみる（ワークショップ　コード）
# 選考みたいなもの

# １デイ　応募してみる
# LINE
# DNA
# ミクシー
# サイバーエージェント
# DMM
# 楽天
# ボーヤーじ
# リクルート
# Google
# ヤフーは結構簡単

# 小さい会社の方が選考難易度が高い（教育たいせいが整ってない

# グノシー
# メルカリ

# NEtflix
# Spotify

# To C

# To B

# wantedly
# マネーフォワード

# ゲンゴー
# トリップアドバイザー

# マイクロソフト

# スタートアップはほとんどインターンからそのままとる

# Techクラン系

# 面白い人いたら話てインターンしていいかきく
# 大体OK

# Linkedinで情報収集

# indeed（ちょっと難しい）

# ２２年度卒とか無視しても良い
# 募集要項はある程度、無視していい
# まともに受けない

# 火曜日の２０時
